---
kind: type
id: T:Autodesk.Revit.DB.ViewSet
source: html/47b47de2-4234-01e0-af21-64334e2a4a4b.htm
---
# Autodesk.Revit.DB.ViewSet

A set that contains views.

## Syntax (C#)
```csharp
public class ViewSet : APIObject, IEnumerable
```